function  lowAppSet = ProbabilityLowerApproximation(U,R,X)
%=========================================================================%
%                                概率粗糙集                              %
%=========================================================================%
% Description:
%    得出概率
%-------------------------------------------------------------------------
% 输入： 
%       x         变量(x1,x2,...,xn) x1是列向量
% 输出：
%       coef      多个变量的相关系数
%-------------------------------------------------------------------------
%   'center'      - 是否执行中心化.  Default is 0.
%   'norm'        - 是否执行归一化.  Default is 0.
%
% version 1.0 --December/2018
% Implemented by: Liyu Yang
% Contact Info  : yangliyuokn@sina.cn

