function [Y] = Stratify(X)
%=========================================================================%
%                                分层化                              %
%=========================================================================%
% Description:
%    根据数据库中的总的数据种类进行分层
%-------------------------------------------------------------------------
% 输入： 
%       X         变量(x1,x2,...,xn) x1是列向量 x1表示属性
% 输出：
%       Y         分层后的数据
%-------------------------------------------------------------------------
%
% version 1.0 -- January/2019
% Implemented by: Liyu Yang
% Contact Info  : yangliyuokn@sina.cn

[~,Xn]        = size(X);
% 得到每列总共有多少层 每一列出现的数的种类数
for ia         = 1:Xn
    [~,~,ic]   = unique(X(:,ia)); % C：唯一数值;ia：唯一数第一次出现的index;ic：唯一数编号
    Yt(:,ia)   = ic;
end
% 从零开始
Y              = Yt - 1;









